changed readme.md, updated llm.adapter for better scoring
